# Random Quote Display
function displayRandomQuote {
    $quotes  =  @(
	"𝒟ℴ  ℴ𝓇  𝒹ℴ  𝓃ℴ𝓉,  𝓉𝒽ℯ𝓇ℯ  𝒾𝓈  𝓃ℴ  𝓉𝓇𝓎.  -  𝒴ℴ𝒹𝒶",
	"𝒯𝒽ℯ  ℴ𝓃𝓁𝓎  𝓁𝒾𝓂𝒾𝓉  𝓉ℴ  ℴ𝓊𝓇  𝓇ℯ𝒶𝓁𝒾𝓏𝒶𝓉𝒾ℴ𝓃  ℴ𝒻  𝓉ℴ𝓂ℴ𝓇𝓇ℴ𝓌  𝒾𝓈  ℴ𝓊𝓇  𝒹ℴ𝓊𝒷𝓉𝓈  ℴ𝒻  𝓉ℴ𝒹𝒶𝓎.  —  ℱ𝓇𝒶𝓃𝓀𝓁𝒾𝓃  𝒟.  ℛℴℴ𝓈ℯ𝓋ℯ𝓁𝓉",
	"ℐ𝓃  𝓉𝒽ℯ  𝓂𝒾𝒹𝒹𝓁ℯ  ℴ𝒻  𝒹𝒾𝒻𝒻𝒾𝒸𝓊𝓁𝓉𝓎  𝓁𝒾ℯ𝓈  ℴ𝓅𝓅ℴ𝓇𝓉𝓊𝓃𝒾𝓉𝓎.  —  𝒜𝓁𝒷ℯ𝓇𝓉  ℰ𝒾𝓃𝓈𝓉ℯ𝒾𝓃",
	"ℐ𝓉  𝒹ℴℯ𝓈  𝓃ℴ𝓉  𝓂𝒶𝓉𝓉ℯ𝓇  𝒽ℴ𝓌  𝓈𝓁ℴ𝓌𝓁𝓎  𝓎ℴ𝓊  ℊℴ  𝒶𝓈  𝓁ℴ𝓃ℊ  𝒶𝓈  𝓎ℴ𝓊  𝒹ℴ  𝓃ℴ𝓉  𝓈𝓉ℴ𝓅.  —  𝒞ℴ𝓃𝒻𝓊𝒸𝒾𝓊𝓈",
	"𝒯𝒽ℯ  𝒿ℴ𝓊𝓇𝓃ℯ𝓎  ℴ𝒻  𝒶  𝓉𝒽ℴ𝓊𝓈𝒶𝓃𝒹  𝓂𝒾𝓁ℯ𝓈  𝒷ℯℊ𝒾𝓃𝓈  𝓌𝒾𝓉𝒽  ℴ𝓃ℯ  𝓈𝓉ℯ𝓅.  —  ℒ𝒶ℴ  𝒯𝓏𝓊",
	"𝒮𝒾𝓂𝓅𝓁𝒾𝒸𝒾𝓉𝓎  𝒾𝓈  𝓉𝒽𝑒  𝓊𝓁𝓉𝒾𝓂𝒶𝓉𝑒  𝓈𝑜𝓅𝒽𝒾𝓈𝓉𝒾𝒸𝒶𝓉𝒾𝑜𝓃.  —  𝒟𝑒𝓈𝒾𝑔𝓃  𝒷𝓎  𝐿𝑒𝑜𝓃𝒶𝓇𝒹𝑜  𝒹𝒶  𝒱𝒾𝓃𝒸𝒾",
	"𝒯𝒽𝑒  𝒷𝑒𝓈𝓉  𝓌𝒶𝓎  𝓉𝑜  𝓅𝓇𝑒𝒹𝒾𝒸𝓉  𝓉𝒽𝑒  𝒻𝓊𝓉𝓊𝓇𝑒  𝒾𝓈  𝓉𝑜  𝒾𝓃𝓋𝑒𝓃𝓉  𝒾𝓉.  —  𝒜𝓁𝒶𝓃  𝒦𝒶𝓎",
	"𝒞𝑜𝒹𝑒  𝒾𝓈  𝓁𝒾𝓀𝑒  𝒽𝓊𝓂𝑜𝓇.  𝒲𝒽𝑒𝓃  𝓎𝑜𝓊  𝒽𝒶𝓋𝑒  𝓉𝑜  𝑒𝓍𝓅𝓁𝒶𝒾𝓃  𝒾𝓉,  𝒾𝓉’𝓈  𝒷𝒶𝒹.  —  𝒞𝑜𝓇𝑜𝓁𝓁𝒶𝓇𝓎  𝓉𝑜  𝐿𝑒𝓃𝒶𝓇𝒹𝒾'𝓈  𝐿𝒶𝓌",
	"𝒜𝓁𝓌𝒶𝓎𝓈  𝒸𝑜𝒹𝑒  𝒶𝓈  𝒾𝒻  𝓉𝒽𝑒  𝑔𝓊𝓎  𝓌𝒽𝑜  𝑒𝓃𝒹𝓈  𝓊𝓅  𝓂𝒶𝒾𝓃𝓉𝒶𝒾𝓃𝒾𝓃𝑔  𝓎𝑜𝓊𝓇  𝒸𝑜𝒹𝑒  𝓌𝒾𝓁𝓁  𝒷𝑒  𝒶  𝓋𝒾𝑜𝓁𝑒𝓃𝓉  𝓅𝓈𝓎𝒸𝒽𝑜𝓅𝒶𝓉𝒽  𝓌𝒽𝑜  𝓀𝓃𝑜𝓌𝓈  𝓌𝒽𝑒𝓇𝑒  𝓎𝑜𝓊  𝓁𝒾𝓋𝑒.  —  𝒞𝑜𝓂𝓂𝑜𝓃  𝒫𝓇𝑜𝑔𝓇𝒶𝓂𝓂𝑒𝓇’𝓈  𝒫𝓇𝑜𝓋𝑒𝓇𝒷",
	"𝐼𝒻  𝒾𝓉  𝓌𝑜𝓇𝓀𝓈,  𝒹𝑜𝓃'𝓉  𝓉𝑜𝓊𝒸𝒽  𝒾𝓉.  —  𝒲𝒾𝓈𝑒  𝒯𝑒𝒸𝒽𝓃𝒾𝒸𝒾𝒶𝓃’𝓈  𝑀𝒶𝓍𝒾𝓂",
	"𝒫𝓇𝑜𝑔𝓇𝒶𝓂𝓂𝒾𝓃𝑔  𝒾𝓈  𝓃𝑜𝓉  𝒶𝒷𝑜𝓊𝓉  𝓉𝓎𝓅𝒾𝓃𝑔...  𝒾𝓉’𝓈  𝒶𝒷𝑜𝓊𝓉  𝓉𝒽𝒾𝓃𝓀𝒾𝓃𝑔.  —  𝒮𝓉𝑒𝓋𝑒  𝒥𝑜𝒷𝓈",
	"𝒫𝑒𝑜𝓅𝓁𝑒  𝓌𝒽𝑜  𝓈𝑒𝓃𝓉  𝓎𝑜𝓊  𝒽𝑜𝓂𝑒  𝓌𝒾𝓉𝒽  𝒽𝑜𝓂𝑒𝓌𝑜𝓇𝓀  𝓌𝑒𝓇𝑒  𝓇𝑒𝒶𝓁𝓁𝓎  𝓈𝑒𝓃𝒹𝒾𝓃𝑔  𝓎𝑜𝓊  𝒽𝑜𝓂𝑒  𝓌𝒾𝓉𝒽  𝒸𝑜𝒹𝑒.  —  𝒰𝓃𝓀𝓃𝑜𝓌𝓃  𝒯𝑒𝒶𝒸𝒽𝑒𝓇",
	"𝒯𝒽𝑒  𝑒𝓁𝑒𝑔𝒶𝓃𝒸𝑒  𝒾𝓈  𝒾𝓃  𝓉𝒽𝑒  𝓈𝑜𝓁𝓊𝓉𝒾𝑜𝓃,  𝓃𝑜𝓉  𝒾𝓃  𝓉𝒽𝑒  𝓁𝒾𝓃𝑒𝓈.  —  𝒜𝓃𝑜𝓃𝓎𝓂𝑜𝓊𝓈",
	"𝒮𝑜𝒻𝓉𝓌𝒶𝓇𝑒  𝑒𝓃𝑔𝒾𝓃𝑒𝑒𝓇𝒾𝓃𝑔  𝒾𝓈  𝓉𝒽𝑒  𝓈𝓉𝓊𝒹𝓎  𝑜𝒻  𝒽𝑜𝓌  𝓉𝑜  𝓈𝑜𝓁𝓋𝑒  𝓅𝓇𝑜𝒷𝓁𝑒𝓂𝓈  𝓉𝒽𝒶𝓉  𝓎𝑜𝓊  𝒸𝑜𝓊𝓁𝒹  𝓃𝑒𝓋𝑒𝓇  𝒽𝒶𝓋𝑒  𝒾𝓂𝒶𝑔𝒾𝓃𝑒𝒹  𝓌𝑒𝓇𝑒  𝓅𝑜𝓈𝓈𝒾𝒷𝓁𝑒.  —  𝒜𝓁𝒶𝓃  𝒫𝑒𝓇𝒻𝑒𝓏",
	"𝐼𝓉'𝓈  𝓃𝑜𝓉  𝒽𝑜𝓌  𝓈𝓂𝒶𝓇𝓉  𝓎𝑜𝓊  𝒶𝓇𝑒,  𝒾𝓉'𝓈  𝒽𝑜𝓌  𝓎𝑜𝓊  𝓈𝓂𝒶𝓇𝓉𝓁𝓎  𝓌𝑜𝓇𝓀.  —  𝒜𝓃𝑜𝓃𝓎𝓂𝑜𝓊𝓈"
	"𝐹𝒾𝓇𝓈𝓉,  𝓈𝑜𝓁𝓋𝑒  𝓉𝒽𝑒  𝓅𝓇𝑜𝒷𝓁𝑒𝓂.  𝒯𝒽𝑒𝓃,  𝓌𝓇𝒾𝓉𝑒  𝓉𝒽𝑒  𝒸𝑜𝒹𝑒.  —  𝒥𝑜𝒽𝓃  𝒥𝑜𝒽𝓃𝓈𝑜𝓃"
	"𝒫𝓇𝑜𝑔𝓇𝒶𝓂𝓈  𝓂𝓊𝓈𝓉  𝒷𝑒  𝓌𝓇𝒾𝓉𝓉𝑒𝓃  𝒻𝑜𝓇  𝓅𝑒𝑜𝓅𝓁𝑒  𝓉𝑜  𝓇𝑒𝒶𝒹,  𝒶𝓃𝒹  𝑜𝓃𝓁𝓎  𝒾𝓃𝒸𝒾𝒹𝑒𝓃𝓉𝒶𝓁𝓁𝓎  𝒻𝑜𝓇  𝓂𝒶𝒸𝒽𝒾𝓃𝑒𝓈  𝓉𝑜  𝑒𝓍𝑒𝒸𝓊𝓉𝑒.  —  𝐻𝒶𝓇𝑜𝓁𝒹  𝒜𝒷𝑒𝓁𝓈𝑜𝓃",
	"𝒜𝓃𝓎  𝒻𝑜𝑜𝓁  𝒸𝒶𝓃  𝓌𝓇𝒾𝓉𝑒  𝒸𝑜𝒹𝑒  𝓉𝒽𝒶𝓉  𝒶  𝒸𝑜𝓂𝓅𝓊𝓉𝑒𝓇  𝒸𝒶𝓃  𝓊𝓃𝒹𝑒𝓇𝓈𝓉𝒶𝓃𝒹.  𝒢𝑜𝑜𝒹  𝓅𝓇𝑜𝑔𝓇𝒶𝓂𝓂𝑒𝓇𝓈  𝓌𝓇𝒾𝓉𝑒  𝒸𝑜𝒹𝑒  𝓉𝒽𝒶𝓉  𝒽𝓊𝓂𝒶𝓃𝓈  𝒸𝒶𝓃  𝓊𝓃𝒹𝑒𝓇𝓈𝓉𝒶𝓃𝒹.  —  𝑀𝒶𝓇𝓉𝒾𝓃  𝐹𝑜𝓌𝓁𝑒𝓇",
	"𝒟𝑒𝒷𝓊𝑔𝑔𝒾𝓃𝑔  𝒾𝓈  𝓁𝒾𝓀𝑒  𝒷𝑒𝒾𝓃𝑔  𝓉𝒽𝑒  𝒹𝑒𝓉𝑒𝒸𝓉𝒾𝓋𝑒  𝒾𝓃  𝒶  𝒸𝓇𝒾𝓂𝑒  𝓂𝑜𝓋𝒾𝑒  𝓌𝒽𝑒𝓇𝑒  𝓎𝑜𝓊  𝒶𝓇𝑒  𝒶𝓁𝓈𝑜  𝓉𝒽𝑒  𝓂𝓊𝓇𝒹𝑒𝓇𝑒𝓇.  —  𝐹𝒾𝓁𝒾𝓅𝑒  𝐹𝑜𝓇𝓉𝑒𝓈",
	"𝒯𝒽𝑒  𝓂𝑜𝓈𝓉  𝒹𝒶𝓂𝒶𝑔𝒾𝓃𝑔  𝓅𝒽𝓇𝒶𝓈𝑒  𝒾𝓃  𝓉𝒽𝑒  𝓁𝒶𝓃𝑔𝓊𝒶𝑔𝑒  𝒾𝓈:  '𝐼𝓉'𝓈  𝒶𝓁𝓌𝒶𝓎𝓈  𝒷𝑒𝑒𝓃  𝒹𝑜𝓃𝑒  𝓉𝒽𝒶𝓉  𝓌𝒶𝓎.'  —  𝒢𝓇𝒶𝒸𝑒  𝐻𝑜𝓅𝓅𝑒𝓇",
	"𝒯𝒽𝑒  𝑜𝓃𝓁𝓎  𝓌𝒶𝓎  𝓉𝑜  𝑔𝑜  𝒻𝒶𝓈𝓉  𝒾𝓈  𝓉𝑜  𝑔𝑜  𝓌𝑒𝓁𝓁.  —  𝑅𝑜𝒷𝑒𝓇𝓉  𝒞.  𝑀𝒶𝓇𝓉𝒾𝓃",
	"𝐸𝓍𝓅𝑒𝓇𝒾𝑒𝓃𝒸𝑒  𝒾𝓈  𝓉𝒽𝑒  𝓃𝒶𝓂𝑒  𝑒𝓋𝑒𝓇𝓎𝑜𝓃𝑒  𝑔𝒾𝓋𝑒𝓈  𝓉𝑜  𝓉𝒽𝑒𝒾𝓇  𝓂𝒾𝓈𝓉𝒶𝓀𝑒𝓈.  —  𝒪𝓈𝒸𝒶𝓇  𝒲𝒾𝓁𝒹𝑒",
	"𝐼𝒻  𝒹𝑒𝒷𝓊𝑔𝑔𝒾𝓃𝑔  𝒾𝓈  𝓉𝒽𝑒  𝓅𝓇𝑜𝒸𝑒𝓈𝓈  𝑜𝒻  𝓇𝑒𝓂𝑜𝓋𝒾𝓃𝑔  𝓈𝑜𝒻𝓉𝓌𝒶𝓇𝑒  𝒷𝓊𝑔𝓈,  𝓉𝒽𝑒𝓃  𝓅𝓇𝑜𝑔𝓇𝒶𝓂𝓂𝒾𝓃𝑔  𝓂𝓊𝓈𝓉  𝒷𝑒  𝓉𝒽𝑒  𝓅𝓇𝑜𝒸𝑒𝓈𝓈  𝑜𝒻  𝓅𝓊𝓉𝓉𝒾𝓃𝑔  𝓉𝒽𝑒𝓂  𝒾𝓃.  —  𝐸𝒹𝓈𝑔𝑒𝓇  𝒟𝒾𝓀𝓈𝓉𝓇𝒶",
	"𝐿𝑒𝒶𝓇𝓃𝒾𝓃𝑔  𝓉𝑜  𝒸𝑜𝒹𝑒  𝒾𝓈  𝓁𝑒𝒶𝓇𝓃𝒾𝓃𝑔  𝓉𝑜  𝒸𝓇𝑒𝒶𝓉𝑒  𝒶𝓃𝒹  𝒾𝓃𝓃𝑜𝓋𝒶𝓉𝑒.  —  𝐸𝓃𝒹𝒶  𝒦𝑒𝓃𝓃𝓎",
	"𝒟𝑜𝓃'𝓉  𝓌𝓇𝒾𝓉𝑒  𝒷𝑒𝓉𝓉𝑒𝓇  𝑒𝓇𝓇𝑜𝓇  𝓂𝑒𝓈𝓈𝒶𝑔𝑒𝓈,  𝓌𝓇𝒾𝓉𝑒  𝒸𝑜𝒹𝑒  𝓉𝒽𝒶𝓉  𝒹𝑜𝑒𝓈𝓃’𝓉  𝓃𝑒𝑒𝒹  𝓉𝒽𝑒𝓂.  —  𝒥𝒶𝓈𝑜𝓃  𝒞.  𝑀𝒸𝒟𝑜𝓃𝒶𝓁𝒹",
	"𝒯𝑒𝓈𝓉𝒾𝓃𝑔  𝓁𝑒𝒶𝒹𝓈  𝓉𝑜  𝒻𝒶𝒾𝓁𝓊𝓇𝑒,  𝒶𝓃𝒹  𝒻𝒶𝒾𝓁𝓊𝓇𝑒  𝓁𝑒𝒶𝒹𝓈  𝓉𝑜  𝓊𝓃𝒹𝑒𝓇𝓈𝓉𝒶𝓃𝒹𝒾𝓃𝑔.  —  𝐵𝓊𝓇𝓉  𝑅𝓊𝓉𝒶𝓃",
	"𝒮𝒾𝓂𝓅𝓁𝒾𝒸𝒾𝓉𝓎  𝒾𝓈  𝓅𝓇𝑒𝓇𝑒𝓆𝓊𝒾𝓈𝒾𝓉𝑒  𝒻𝑜𝓇  𝓇𝑒𝓁𝒾𝒶𝒷𝒾𝓁𝒾𝓉𝓎.  —  𝐸𝒹𝓈𝑔𝑒𝓇  𝒲.  𝒟𝒾𝓀𝓈𝓉𝓇𝒶",
	"𝐵𝑒𝒻𝑜𝓇𝑒  𝓈𝑜𝒻𝓉𝓌𝒶𝓇𝑒  𝒸𝒶𝓃  𝒷𝑒  𝓇𝑒𝓊𝓈𝒶𝒷𝓁𝑒,  𝒾𝓉  𝒻𝒾𝓇𝓈𝓉  𝒽𝒶𝓈  𝓉𝑜  𝒷𝑒  𝓊𝓈𝒶𝒷𝓁𝑒.  —  𝑅𝒶𝓁𝓅𝒽  𝒥𝑜𝒽𝓃𝓈𝑜𝓃",
	"𝒯𝒽𝑒  𝑔𝓇𝑒𝒶𝓉𝑒𝓈𝓉  𝑒𝓃𝑒𝓂𝓎  𝑜𝒻  𝓀𝓃𝑜𝓌𝓁𝑒𝒹𝑔𝑒  𝒾𝓈  𝓃𝑜𝓉  𝒾𝑔𝓃𝑜𝓇𝒶𝓃𝒸𝑒,  𝒾𝓉  𝒾𝓈  𝓉𝒽𝑒  𝒾𝓁𝓁𝓊𝓈𝒾𝑜𝓃  𝑜𝒻  𝓀𝓃𝑜𝓌𝓁𝑒𝒹𝑔𝑒.  —  𝒮𝓉𝑒𝓅𝒽𝑒𝓃  𝐻𝒶𝓌𝓀𝒾𝓃𝑔",
	"𝒯𝒽𝑒  𝓈𝑒𝒸𝓇𝑒𝓉  𝓉𝑜  𝑔𝑒𝓉𝓉𝒾𝓃𝑔  𝒶𝒽𝑒𝒶𝒹  𝒾𝓈  𝑔𝑒𝓉𝓉𝒾𝓃𝑔  𝓈𝓉𝒶𝓇𝓉𝑒𝒹.  —  𝑀𝒶𝓇𝓀  𝒯𝓌𝒶𝒾𝓃",
	"𝒜  𝓁𝒶𝓃𝑔𝓊𝒶𝑔𝑒  𝓉𝒽𝒶𝓉  𝒹𝑜𝑒𝓈𝓃’𝓉  𝒶𝒻𝒻𝑒𝒸𝓉  𝓉𝒽𝑒  𝓌𝒶𝓎  𝓎𝑜𝓊  𝓉𝒽𝒾𝓃𝓀  𝒶𝒷𝑜𝓊𝓉  𝓅𝓇𝑜𝑔𝓇𝒶𝓂𝓂𝒾𝓃𝑔  𝒾𝓈  𝓃𝑜𝓉  𝓌𝑜𝓇𝓉𝒽  𝓀𝓃𝑜𝓌𝒾𝓃𝑔.  —  𝒜𝓁𝒶𝓃  𝒥.  𝒫𝑒𝓇𝓁𝒾𝓈",
	"𝐼𝓉'𝓈  𝓃𝑜𝓉  𝒶  𝒷𝓊𝑔;  𝒾𝓉'𝓈  𝒶𝓃  𝓊𝓃𝒹𝑜𝒸𝓊𝓂𝑒𝓃𝓉𝑒𝒹  𝒻𝑒𝒶𝓉𝓊𝓇𝑒!  —  𝒜𝓃𝑜𝓃𝓎𝓂𝑜𝓊𝓈",
	"𝒞𝑜𝒹𝑒  𝓃𝑒𝓋𝑒𝓇  𝓁𝒾𝑒𝓈,  𝒸𝑜𝓂𝓂𝑒𝓃𝓉𝓈  𝓈𝑜𝓂𝑒𝓉𝒾𝓂𝑒𝓈  𝒹𝑜.  —  𝑅𝑜𝓃  𝒥𝑒𝒻𝒻𝓇𝒾𝑒𝓈",
	"𝒮𝑜𝒻𝓉𝓌𝒶𝓇𝑒  𝒾𝓈  𝒶  𝑔𝓇𝑒𝒶𝓉  𝒸𝑜𝓂𝒷𝒾𝓃𝒶𝓉𝒾𝑜𝓃  𝑜𝒻  𝒶𝓇𝓉𝒾𝓈𝓉𝓇𝓎  𝒶𝓃𝒹  𝑒𝓃𝑔𝒾𝓃𝑒𝑒𝓇𝒾𝓃𝑔.  —  𝐵𝒾𝓁𝓁  𝒢𝒶𝓉𝑒𝓈",
	"𝒯𝒽𝑒  𝒻𝓊𝓃𝒸𝓉𝒾𝑜𝓃  𝑜𝒻  𝑔𝑜𝑜𝒹  𝓈𝑜𝒻𝓉𝓌𝒶𝓇𝑒  𝒾𝓈  𝓉𝑜  𝓂𝒶𝓀𝑒  𝓉𝒽𝑒  𝒸𝑜𝓂𝓅𝓁𝑒𝓍  𝒶𝓅𝓅𝑒𝒶𝓇  𝓉𝑜  𝒷𝑒  𝓈𝒾𝓂𝓅𝓁𝑒.  —  𝒢𝓇𝒶𝒹𝓎  𝐵𝑜𝑜𝒸𝒽"
	)
    # Get a random quote from the array
    $randomQuote = Get-Random -InputObject $quotes

    # Display the random quote in magenta color
    Write-Host $randomQuote -ForegroundColor Magenta
	}
# Call the function to test
displayRandomQuote